#Напишите программу, которая найдёт произведение пар чисел списка. 
#Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#Пример:
#[2, 3, 4, 5, 6] => [12, 15, 16];
#[2, 3, 5, 6] => [12, 15]
list= [-1, 3, 4, 5, 6, 9]
print(list)
res_list = []
i=0
for i in range(len(list)):
    if i < len(list)/2:
        last = (i+1)*-1
        res_list.append(list[i]*list[last])
        i+=1    
print(res_list)



